zupcorp23012025.Расширение1/src/Documents/ВводДанныхВрачи/ВводДанныхВрачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводДанныхВрачи</name>
  <registerRecords>InformationRegister.ДанныеПоАптекам</registerRecords>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланПоВыручке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактПоВыручкеПродавцов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ВидыСтатусов</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцДаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧРасчет</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядКатегория</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>РазрядПодразделение</name>
      <type>
        <types>CatalogRef.РазрядыКатегорииДолжностей</types>
      </type>
    </attributes>
    <attributes>
      <name>ТабНомер</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИНН</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>Минимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Максимум</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МинимумВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимумВремени</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтработаноВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНочь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВыходныеВремяДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиВремяДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздникиВремяНочь</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтогоБонусов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаУслугВрача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаУслугиВрача</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаОчковыеЛинзы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БонусЗаОчковыеЛинзы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеСотрудника</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Уволенная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗапретРедактирования</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПервоначальныйРасчетПоУволенным</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/Documents/ВводДанныхВрачи/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр ДанныеПоАптекам
	Движения.ДанныеПоАптекам.Записывать = Истина;
	//Если ПланПоВыручке=ТЧРасчет.Итог("СуммаУслугВрача")+ТЧРасчет.Итог("СуммаОчковыеЛинзы") тогда
		Для Каждого ТекСтрокаТЧРасчет Из ТЧРасчет Цикл 
			Если ТекСтрокаТЧРасчет.Уволенная=Ложь тогда 
				Движение = Движения.ДанныеПоАптекам.Добавить();
				Движение.Статус = Статус;
				Движение.Подразделение = ТекСтрокаТЧРасчет.ПодразделениеСотрудника;
				Движение.Должность = ТекСтрокаТЧРасчет.Должность;
				Движение.РазрядКатегория = ТекСтрокаТЧРасчет.РазрядКатегория;
				Движение.РазрядПодразделение = ТекСтрокаТЧРасчет.РазрядПодразделение;
				Движение.ПодразделениеРаботы = Подразделение;
				Движение.Сотрудник = ТекСтрокаТЧРасчет.Сотрудник;
				Движение.ФизическоеЛицо = ТекСтрокаТЧРасчет.ФизическоеЛицо;
				Движение.ДатаПо = ДатаПо;
				Движение.ДатаС = ДатаС;
				Движение.ВремяДень = ТекСтрокаТЧРасчет.ВремяДень;
				Движение.ВремяНочь = ТекСтрокаТЧРасчет.ВремяНочь;
				Движение.ПраздникиВремяДень=ТекСтрокаТЧРасчет.ПраздникиВремяДень;
				Движение.ВыходныеВремяДень=ТекСтрокаТЧРасчет.ВыходныеВремяДень;
				Если ТекСтрокаТЧРасчет.ПервоначальныйРасчетПоУволенным=Истина тогда
					Движение.Уволенная=истина;
				КонецЕсли;
				Движение.СуммаУслугВрача=ТекСтрокаТЧРасчет.СуммаУслугВрача;
				Движение.БонусЗаУслугиВрача=ТекСтрокаТЧРасчет.БонусЗаУслугиВрача;
				Движение.СуммаОчковыеЛинзы=ТекСтрокаТЧРасчет.СуммаОчковыеЛинзы;
				Движение.БонусЗаОчковыеЛинзы=ТекСтрокаТЧРасчет.БонусЗаОчковыеЛинзы;
			КонецЕсли;
		КонецЦикла;
	//иначе 
	//	Сообщить("Фактическая выручка превышает значение сумм по личной выручке");
	//	Отказ=истина;
	//конецесли;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
